# MirrorColorByObject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mirror..::..MirrorColorByObject Property
Mirror Class See Also
---
The property labeled "Color By Object" from the "Mirror" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MirrorColorByObject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MirrorColorByObject As String
	Get
```

Visual C++
---
```text
public:
static property String^ MirrorColorByObject {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
Mirror Class
Autodesk.Revit.DB.Visual Namespace